Revit 2027 API
RebarFreeFormAccessor.SetComputationDataFor3DPathSet Method
 For a free form set distributed along a 3D path, this method sets the computation data.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetComputationDataFor3DPathSet(
	ComputationDataFor3DPathSet computationData
)
Public Sub SetComputationDataFor3DPathSet (
	computationData As ComputationDataFor3DPathSet
)
public:
void SetComputationDataFor3DPathSet(
	ComputationDataFor3DPathSet^ computationData
)
member SetComputationDataFor3DPathSet :
        computationData : ComputationDataFor3DPathSet -> unit
Parameters
computationData ComputationDataFor3DPathSet
 The computation data.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace